class LionFSM:
    lion_get = {"голодный":
                    {"антилопа": {"действие": "съесть", "состояние": "сытый"},
                     "охотник": {"действие": "убежать", "состояние": "голодный"},
                     "дерево": {"действие": "спать", "состояние": "голодный"}},
                "сытый":
                    {"антилопа": {"действие": "спать", "состояние": "голодный"},
                     "охотник": {"действие": "убежать", "состояние": "голодный"},
                     "дерево": {"действие": "смотреть", "состояние": "голодный"}}}

    def __init__(self, state):
        if state != "голодный" and state != "сытый":
            raise ValueError("Состояние не определено")
        self.action = ""
        self.state = state

    def input(self, symbol):
        if symbol != "антилопа" and symbol != "охотник" and symbol != "дерево":
            raise ValueError('Неверный событие')
        self.action = self.lion_get[self.state][symbol]['действие']
        self.state = self.lion_get[self.state][symbol]['состояние']
